# Latihan Pandas Data Frame

Untuk mahasiswa data science intitut Teknologi Telkom Purwokerto
tanggal 4 April 2021

In [1]:
# import semua library yang diperlukan

In [2]:
# Pandas
import pandas as pd

In [3]:
barang = {'Nama Barang' : ['Buku Tulis','Pena','Penggaris','Printer'], 'Harga Satuan' : [25000,700,2500,12000]}

In [4]:
# buat data frame

In [5]:
df = pd.DataFrame(barang, columns=['Nama Barang','Harga Satuan'])

In [6]:
# panggil dataframe

In [7]:
df

  Nama Barang  Harga Satuan
0  Buku Tulis         25000
1        Pena           700
2   Penggaris          2500
3     Printer         12000

In [8]:
#insert kolom

In [9]:
df.insert(2,'Jumlah Barang',[100,200,300,400])

In [10]:
#tampilkun update insert

In [11]:
df

  Nama Barang  Harga Satuan  Jumlah Barang
0  Buku Tulis         25000            100
1        Pena           700            200
2   Penggaris          2500            300
3     Printer         12000            400

In [13]:
# menambahkan kolom baru 
df['Total Harga'] = df['Harga Satuan'] * df['Jumlah Barang']

In [14]:
# tampilkan data baru

In [18]:
df

  Nama Barang  Harga Satuan  Jumlah Barang  Total Harga
0  Buku Tulis         25000            100      2500000
1        Pena           700            200       140000
2   Penggaris          2500            300       750000
3     Printer         12000            400      4800000

In [19]:
# menambahkan kolom discount 10 %

In [20]:
df['Discount 10%'] = df['Total Harga'] * 10/100

In [22]:
#pangggil data frame
df

  Nama Barang  Harga Satuan  Jumlah Barang  Total Harga  Discount 10%
0  Buku Tulis         25000            100      2500000      250000.0
1        Pena           700            200       140000       14000.0
2   Penggaris          2500            300       750000       75000.0
3     Printer         12000            400      4800000      480000.0

## Menambah Kolom Harga Jual

In [24]:
#menambahkan kolom harga jual
df['Harga Jual'] = df['Total Harga'] - df['Discount 10%']

In [25]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [26]:
# Menghapus kolom
# sebelum nya kita buat sebuah kolom dummy agar data kita tidak rusak
df.insert(6, "Penjual", "Sianu")

In [27]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual,Penjual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0,Sianu
1,Pena,700,200,140000,14000.0,126000.0,Sianu
2,Penggaris,2500,300,750000,75000.0,675000.0,Sianu
3,Printer,12000,400,4800000,480000.0,4320000.0,Sianu

In [28]:
# hapus kolom penjual
df.drop('Penjual', axis=1)

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [29]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual,Penjual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0,Sianu
1,Pena,700,200,140000,14000.0,126000.0,Sianu
2,Penggaris,2500,300,750000,75000.0,675000.0,Sianu
3,Printer,12000,400,4800000,480000.0,4320000.0,Sianu

In [30]:
#ternyata data penjual masih ada
#kita hapus permanen dengan inplace

In [31]:
df.drop('Penjual', axis=1, inplace=True)

In [32]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

## Menghapus Baris

In [35]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [36]:
df.drop(2)

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [37]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [38]:
# menghapus permanen

In [41]:
df.drop(2, axis=0)

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [40]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [42]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

## Menampilkan Kolom Tertentu

In [43]:
# Menampilkan kolom nama barang saja

In [47]:
# df['namakolom']

df['Nama Barang']

0    Buku Tulis
1          Pena
2     Penggaris
3       Printer
Name: Nama Barang, dtype: object

In [48]:
# Menampilkan dengan banyak kolom

In [49]:
df[['Nama Barang', 'Harga Satuan']]

  Nama Barang  Harga Satuan
0  Buku Tulis         25000
1        Pena           700
2   Penggaris          2500
3     Printer         12000

In [52]:
df.loc[2]

Nama Barang      Penggaris
Harga Satuan          2500
Jumlah Barang          300
Total Harga         750000
Discount 10%         75000
Harga Jual          675000
Name: 2, dtype: object

In [53]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [54]:
# iloc

df.iloc[1]

Nama Barang        Pena
Harga Satuan        700
Jumlah Barang       200
Total Harga      140000
Discount 10%      14000
Harga Jual       126000
Name: 1, dtype: object

In [55]:
df.iloc[2]

Nama Barang      Penggaris
Harga Satuan          2500
Jumlah Barang          300
Total Harga         750000
Discount 10%         75000
Harga Jual          675000
Name: 2, dtype: object

In [64]:
df.iloc[2]

Nama Barang      Penggaris
Harga Satuan          2500
Jumlah Barang          300
Total Harga         750000
Discount 10%         75000
Harga Jual          675000
Name: 2, dtype: object

In [65]:
# iloc dengan dataframe

In [67]:
df.iloc[:2]

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0

In [69]:
df.loc[2,'Nama Barang'] # menampilkan baris ke 2, kolom Barang

'Penggaris'

In [70]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [71]:
# menampilkan nama barang dari buku tulis dari data barang
#select * from namabarang where namabarang = 'buku tulis'

df.loc[df['Nama Barang'] == 'Buku Tulis']

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0

In [72]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

## Simpan data ke CSV

In [73]:
df.to_csv('data_barang.csv', index = False, header=True)

## Panggil file CSV

In [74]:
data = pd.read_csv('data_barang.csv')

In [75]:
## tampilkan datanya

data

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

## Simpan ke Excel

In [76]:
df

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000.0,2250000.0
1,Pena,700,200,140000,14000.0,126000.0
2,Penggaris,2500,300,750000,75000.0,675000.0
3,Printer,12000,400,4800000,480000.0,4320000.0

In [77]:
df.to_excel('data_barang.xlsx')

In [78]:
## membaca data excel

In [79]:
xlsx = pd.read_excel('data_barang.xlsx')

In [80]:
xlsx

,Unnamed: 0,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,0,Buku Tulis,25000,100,2500000,250000,2250000
1,1,Pena,700,200,140000,14000,126000
2,2,Penggaris,2500,300,750000,75000,675000
3,3,Printer,12000,400,4800000,480000,4320000

In [81]:
df.to_excel('databarang1.xlsx', index = False, header=True)

In [82]:
dataEx = pd.read_excel('databarang1.xlsx')

In [83]:
dataEx

,Nama Barang,Harga Satuan,Jumlah Barang,Total Harga,Discount 10%,Harga Jual
0,Buku Tulis,25000,100,2500000,250000,2250000
1,Pena,700,200,140000,14000,126000
2,Penggaris,2500,300,750000,75000,675000
3,Printer,12000,400,4800000,480000,4320000